###################################################################

# Created by write_sdc on Tue Jul 29 16:53:25 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc18_wl10 -library slow
set_max_area 0
set_load -pin_load 6 [get_ports {y_re[11]}]
set_load -pin_load 6 [get_ports {y_re[10]}]
set_load -pin_load 6 [get_ports {y_re[9]}]
set_load -pin_load 6 [get_ports {y_re[8]}]
set_load -pin_load 6 [get_ports {y_re[7]}]
set_load -pin_load 6 [get_ports {y_re[6]}]
set_load -pin_load 6 [get_ports {y_re[5]}]
set_load -pin_load 6 [get_ports {y_re[4]}]
set_load -pin_load 6 [get_ports {y_re[3]}]
set_load -pin_load 6 [get_ports {y_re[2]}]
set_load -pin_load 6 [get_ports {y_re[1]}]
set_load -pin_load 6 [get_ports {y_re[0]}]
set_load -pin_load 6 [get_ports {y_im[11]}]
set_load -pin_load 6 [get_ports {y_im[10]}]
set_load -pin_load 6 [get_ports {y_im[9]}]
set_load -pin_load 6 [get_ports {y_im[8]}]
set_load -pin_load 6 [get_ports {y_im[7]}]
set_load -pin_load 6 [get_ports {y_im[6]}]
set_load -pin_load 6 [get_ports {y_im[5]}]
set_load -pin_load 6 [get_ports {y_im[4]}]
set_load -pin_load 6 [get_ports {y_im[3]}]
set_load -pin_load 6 [get_ports {y_im[2]}]
set_load -pin_load 6 [get_ports {y_im[1]}]
set_load -pin_load 6 [get_ports {y_im[0]}]
set_load -pin_load 6 [get_ports do_en]
set_max_capacitance 0.2 [get_ports clk]
set_max_capacitance 0.2 [get_ports reset]
set_max_capacitance 0.2 [get_ports di_en]
set_max_capacitance 0.2 [get_ports {x_re[11]}]
set_max_capacitance 0.2 [get_ports {x_re[10]}]
set_max_capacitance 0.2 [get_ports {x_re[9]}]
set_max_capacitance 0.2 [get_ports {x_re[8]}]
set_max_capacitance 0.2 [get_ports {x_re[7]}]
set_max_capacitance 0.2 [get_ports {x_re[6]}]
set_max_capacitance 0.2 [get_ports {x_re[5]}]
set_max_capacitance 0.2 [get_ports {x_re[4]}]
set_max_capacitance 0.2 [get_ports {x_re[3]}]
set_max_capacitance 0.2 [get_ports {x_re[2]}]
set_max_capacitance 0.2 [get_ports {x_re[1]}]
set_max_capacitance 0.2 [get_ports {x_re[0]}]
set_max_capacitance 0.2 [get_ports {x_im[11]}]
set_max_capacitance 0.2 [get_ports {x_im[10]}]
set_max_capacitance 0.2 [get_ports {x_im[9]}]
set_max_capacitance 0.2 [get_ports {x_im[8]}]
set_max_capacitance 0.2 [get_ports {x_im[7]}]
set_max_capacitance 0.2 [get_ports {x_im[6]}]
set_max_capacitance 0.2 [get_ports {x_im[5]}]
set_max_capacitance 0.2 [get_ports {x_im[4]}]
set_max_capacitance 0.2 [get_ports {x_im[3]}]
set_max_capacitance 0.2 [get_ports {x_im[2]}]
set_max_capacitance 0.2 [get_ports {x_im[1]}]
set_max_capacitance 0.2 [get_ports {x_im[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports di_en]
set_max_fanout 20 [get_ports {x_re[11]}]
set_max_fanout 20 [get_ports {x_re[10]}]
set_max_fanout 20 [get_ports {x_re[9]}]
set_max_fanout 20 [get_ports {x_re[8]}]
set_max_fanout 20 [get_ports {x_re[7]}]
set_max_fanout 20 [get_ports {x_re[6]}]
set_max_fanout 20 [get_ports {x_re[5]}]
set_max_fanout 20 [get_ports {x_re[4]}]
set_max_fanout 20 [get_ports {x_re[3]}]
set_max_fanout 20 [get_ports {x_re[2]}]
set_max_fanout 20 [get_ports {x_re[1]}]
set_max_fanout 20 [get_ports {x_re[0]}]
set_max_fanout 20 [get_ports {x_im[11]}]
set_max_fanout 20 [get_ports {x_im[10]}]
set_max_fanout 20 [get_ports {x_im[9]}]
set_max_fanout 20 [get_ports {x_im[8]}]
set_max_fanout 20 [get_ports {x_im[7]}]
set_max_fanout 20 [get_ports {x_im[6]}]
set_max_fanout 20 [get_ports {x_im[5]}]
set_max_fanout 20 [get_ports {x_im[4]}]
set_max_fanout 20 [get_ports {x_im[3]}]
set_max_fanout 20 [get_ports {x_im[2]}]
set_max_fanout 20 [get_ports {x_im[1]}]
set_max_fanout 20 [get_ports {x_im[0]}]
set_max_transition 0.3 [get_ports clk]
set_max_transition 0.3 [get_ports reset]
set_max_transition 0.3 [get_ports di_en]
set_max_transition 0.3 [get_ports {x_re[11]}]
set_max_transition 0.3 [get_ports {x_re[10]}]
set_max_transition 0.3 [get_ports {x_re[9]}]
set_max_transition 0.3 [get_ports {x_re[8]}]
set_max_transition 0.3 [get_ports {x_re[7]}]
set_max_transition 0.3 [get_ports {x_re[6]}]
set_max_transition 0.3 [get_ports {x_re[5]}]
set_max_transition 0.3 [get_ports {x_re[4]}]
set_max_transition 0.3 [get_ports {x_re[3]}]
set_max_transition 0.3 [get_ports {x_re[2]}]
set_max_transition 0.3 [get_ports {x_re[1]}]
set_max_transition 0.3 [get_ports {x_re[0]}]
set_max_transition 0.3 [get_ports {x_im[11]}]
set_max_transition 0.3 [get_ports {x_im[10]}]
set_max_transition 0.3 [get_ports {x_im[9]}]
set_max_transition 0.3 [get_ports {x_im[8]}]
set_max_transition 0.3 [get_ports {x_im[7]}]
set_max_transition 0.3 [get_ports {x_im[6]}]
set_max_transition 0.3 [get_ports {x_im[5]}]
set_max_transition 0.3 [get_ports {x_im[4]}]
set_max_transition 0.3 [get_ports {x_im[3]}]
set_max_transition 0.3 [get_ports {x_im[2]}]
set_max_transition 0.3 [get_ports {x_im[1]}]
set_max_transition 0.3 [get_ports {x_im[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 8  -waveform {0 4}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.2  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  -max 4.8  [get_ports reset]
set_input_delay -clock clk  -min 0  [get_ports reset]
set_input_delay -clock clk  -max 4.8  [get_ports di_en]
set_input_delay -clock clk  -min 0  [get_ports di_en]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[11]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[11]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[10]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[10]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[9]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[9]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[8]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[8]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[7]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[7]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[6]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[6]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[5]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[5]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[4]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[4]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[3]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[3]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[2]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[2]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[1]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[1]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_re[0]}]
set_input_delay -clock clk  -min 0  [get_ports {x_re[0]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[11]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[11]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[10]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[10]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[9]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[9]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[8]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[8]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[7]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[7]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[6]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[6]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[5]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[5]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[4]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[4]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[3]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[3]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[2]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[2]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[1]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[1]}]
set_input_delay -clock clk  -max 4.8  [get_ports {x_im[0]}]
set_input_delay -clock clk  -min 0  [get_ports {x_im[0]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[11]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[10]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[9]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[8]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[7]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[6]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[5]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[4]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[3]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[2]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[1]}]
set_output_delay -clock clk  4.8  [get_ports {y_re[0]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[11]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[10]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[9]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[8]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[7]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[6]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[5]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[4]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[3]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[2]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[1]}]
set_output_delay -clock clk  4.8  [get_ports {y_im[0]}]
set_output_delay -clock clk  4.8  [get_ports do_en]
set_input_transition -max 0.3  [get_ports clk]
set_input_transition -min 0.3  [get_ports clk]
set_input_transition -max 0.3  [get_ports reset]
set_input_transition -min 0.3  [get_ports reset]
set_input_transition -max 0.3  [get_ports di_en]
set_input_transition -min 0.3  [get_ports di_en]
set_input_transition -max 0.3  [get_ports {x_re[11]}]
set_input_transition -min 0.3  [get_ports {x_re[11]}]
set_input_transition -max 0.3  [get_ports {x_re[10]}]
set_input_transition -min 0.3  [get_ports {x_re[10]}]
set_input_transition -max 0.3  [get_ports {x_re[9]}]
set_input_transition -min 0.3  [get_ports {x_re[9]}]
set_input_transition -max 0.3  [get_ports {x_re[8]}]
set_input_transition -min 0.3  [get_ports {x_re[8]}]
set_input_transition -max 0.3  [get_ports {x_re[7]}]
set_input_transition -min 0.3  [get_ports {x_re[7]}]
set_input_transition -max 0.3  [get_ports {x_re[6]}]
set_input_transition -min 0.3  [get_ports {x_re[6]}]
set_input_transition -max 0.3  [get_ports {x_re[5]}]
set_input_transition -min 0.3  [get_ports {x_re[5]}]
set_input_transition -max 0.3  [get_ports {x_re[4]}]
set_input_transition -min 0.3  [get_ports {x_re[4]}]
set_input_transition -max 0.3  [get_ports {x_re[3]}]
set_input_transition -min 0.3  [get_ports {x_re[3]}]
set_input_transition -max 0.3  [get_ports {x_re[2]}]
set_input_transition -min 0.3  [get_ports {x_re[2]}]
set_input_transition -max 0.3  [get_ports {x_re[1]}]
set_input_transition -min 0.3  [get_ports {x_re[1]}]
set_input_transition -max 0.3  [get_ports {x_re[0]}]
set_input_transition -min 0.3  [get_ports {x_re[0]}]
set_input_transition -max 0.3  [get_ports {x_im[11]}]
set_input_transition -min 0.3  [get_ports {x_im[11]}]
set_input_transition -max 0.3  [get_ports {x_im[10]}]
set_input_transition -min 0.3  [get_ports {x_im[10]}]
set_input_transition -max 0.3  [get_ports {x_im[9]}]
set_input_transition -min 0.3  [get_ports {x_im[9]}]
set_input_transition -max 0.3  [get_ports {x_im[8]}]
set_input_transition -min 0.3  [get_ports {x_im[8]}]
set_input_transition -max 0.3  [get_ports {x_im[7]}]
set_input_transition -min 0.3  [get_ports {x_im[7]}]
set_input_transition -max 0.3  [get_ports {x_im[6]}]
set_input_transition -min 0.3  [get_ports {x_im[6]}]
set_input_transition -max 0.3  [get_ports {x_im[5]}]
set_input_transition -min 0.3  [get_ports {x_im[5]}]
set_input_transition -max 0.3  [get_ports {x_im[4]}]
set_input_transition -min 0.3  [get_ports {x_im[4]}]
set_input_transition -max 0.3  [get_ports {x_im[3]}]
set_input_transition -min 0.3  [get_ports {x_im[3]}]
set_input_transition -max 0.3  [get_ports {x_im[2]}]
set_input_transition -min 0.3  [get_ports {x_im[2]}]
set_input_transition -max 0.3  [get_ports {x_im[1]}]
set_input_transition -min 0.3  [get_ports {x_im[1]}]
set_input_transition -max 0.3  [get_ports {x_im[0]}]
set_input_transition -min 0.3  [get_ports {x_im[0]}]
